particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
/*
 * Copyright (c) 2018 Particle Industries, Inc.  All rights reserved.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation, either
 * version 3 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, see <http://www.gnu.org/licenses/>.
 */

#include "logging.h"
LOG_SOURCE_CATEGORY("hal.ble")

#include "ble_hal.h"

#if HAL_PLATFORM_BLE

/* Headers included from nRF5_SDK/components/softdevice/s140/headers */
#include "ble.h"
#include "ble_gap.h"
#include "ble_gatt.h"
#include "ble_gatts.h"
#include "ble_gattc.h"
#include "ble_types.h"
/* Headers included from nRF5_SDK/components/softdevice/common */
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_soc.h"

#include "app_util.h"

#include "concurrent_hal.h"
#include "static_recursive_mutex.h"
#include <mutex>

#include "gpio_hal.h"
#include "device_code.h"
#include "system_error.h"
#include "sdk_config_system.h"
#include "spark_wiring_vector.h"
#include "simple_pool_allocator.h"
#include <string.h>
#include <memory>
#include "check_nrf.h"
#include "check.h"
#include "scope_guard.h"

static_assert(NRF_SDH_BLE_PERIPHERAL_LINK_COUNT == 1, "Multiple simultaneous peripheral connections are not supported");
static_assert(NRF_SDH_BLE_TOTAL_LINK_COUNT <= 20, "Maximum supported number of concurrent connections in the peripheral and central roles combined exceeded");

using spark::Vector;
using namespace particle::ble;

#define BLE_CONN_CFG_TAG 1

StaticRecursiveMutex s_bleMutex;

//anonymous namespace
namespace {

// BLE service base start handle.
const hal_ble_attr_handle_t SERVICES_BASE_START_HANDLE = 0x0001;
// BLE service top end handle.
const hal_ble_attr_handle_t SERVICES_TOP_END_HANDLE = 0xFFFF;

// Pool for storing scan results.
const size_t OBSERVER_SCANNED_DATA_POOL_SIZE = 1024;
// Pool for GATT Server to store received data.
const size_t GATT_SERVER_DATA_REC_POOL_SIZE = 1024;
// Pool for storing discovered service or characteristics.
static const size_t GATT_CLIENT_DISC_SVC_CHAR_POOL_SIZE = 2048;
// Pool for GATT Client to store received data.
static const size_t GATT_CLIENT_DATA_REC_POOL_SIZE = 1024;

// Timeout for GAP connection operation.
const uint32_t CONNECTION_OPERATION_TIMEOUT_MS = 5000;
// Timeout for sending notification/indication.
const uint32_t BLE_HVX_PROCEDURE_TIMEOUT_MS = 5000;
// Timeout for BLE service discovery procedure.
const uint32_t BLE_DICOVERY_PROCEDURE_TIMEOUT_MS = 10000;
// Timeout for data read write procedure.
const uint32_t BLE_READ_WRITE_PROCEDURE_TIMEOUT_MS = 5000;
// Delay for GATT Client to send the ATT MTU exchanging request.
static const uint32_t BLE_ATT_MTU_EXCHANGE_DELAY_MS = 800;

static const uint8_t BleAdvEvtTypeMap[] = {
    BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED,
    BLE_GAP_ADV_TYPE_EXTENDED_CONNECTABLE_NONSCANNABLE_UNDIRECTED,
    BLE_GAP_ADV_TYPE_CONNECTABLE_NONSCANNABLE_DIRECTED,
    BLE_GAP_ADV_TYPE_NONCONNECTABLE_NONSCANNABLE_UNDIRECTED,
    BLE_GAP_ADV_TYPE_EXTENDED_NONCONNECTABLE_NONSCANNABLE_DIRECTED,
    BLE_GAP_ADV_TYPE_NONCONNECTABLE_SCANNABLE_UNDIRECTED,
    BLE_GAP_ADV_TYPE_EXTENDED_NONCONNECTABLE_SCANNABLE_DIRECTED
};

system_error_t sysError(uint32_t error) {
    switch (error) {
        case NRF_SUCCESS:
            return SYSTEM_ERROR_NONE;
        case NRF_ERROR_SVC_HANDLER_MISSING:
        case NRF_ERROR_NOT_SUPPORTED:
            return SYSTEM_ERROR_NOT_SUPPORTED;
        case NRF_ERROR_SOFTDEVICE_NOT_ENABLED:
        case NRF_ERROR_INVALID_STATE:
            return SYSTEM_ERROR_INVALID_STATE;
        case NRF_ERROR_INTERNAL:
            return SYSTEM_ERROR_INTERNAL;
        case NRF_ERROR_NO_MEM:
            return SYSTEM_ERROR_NO_MEMORY;
        case NRF_ERROR_NOT_FOUND:
            return SYSTEM_ERROR_NOT_FOUND;
        case NRF_ERROR_INVALID_PARAM:
        case NRF_ERROR_INVALID_LENGTH:
        case NRF_ERROR_INVALID_FLAGS:
        case NRF_ERROR_INVALID_DATA:
        case NRF_ERROR_DATA_SIZE:
        case NRF_ERROR_NULL:
            return SYSTEM_ERROR_INVALID_ARGUMENT;
        case NRF_ERROR_TIMEOUT:
            return SYSTEM_ERROR_TIMEOUT;
        case NRF_ERROR_FORBIDDEN:
        case NRF_ERROR_INVALID_ADDR:
            return SYSTEM_ERROR_NOT_ALLOWED;
        case NRF_ERROR_BUSY:
            return SYSTEM_ERROR_BUSY;
        case NRF_ERROR_CONN_COUNT:
            return SYSTEM_ERROR_LIMIT_EXCEEDED;
        case NRF_ERROR_RESOURCES:
            return SYSTEM_ERROR_ABORTED;
        default:
            return SYSTEM_ERROR_UNKNOWN;
    }
}

bool addressEqual(const hal_ble_addr_t& srcAddr, const hal_ble_addr_t& destAddr) {
    return (srcAddr.addr_type == destAddr.addr_type && !memcmp(srcAddr.addr, destAddr.addr, BLE_SIG_ADDR_LEN));
}

} //anonymous namespace

class GattBase {
public:
    /*
     * A device's Exchange MTU Request shall contain the same MTU as the
     * device's Exchange MTU Response (i.e. the MTU shall be symmetric).
     */
    class LinkAttMtu {
    public:
        LinkAttMtu() : connHandle(BLE_INVALID_CONN_HANDLE), effective(BLE_DEFAULT_ATT_MTU_SIZE), isExchanged(false) {}
        ~LinkAttMtu() = default;

        bool operator == (const LinkAttMtu& attMtu) const {
            return (attMtu.connHandle == connHandle);
        }

        hal_ble_conn_handle_t connHandle;
        size_t effective;
        bool isExchanged;
    };

    GattBase() {
        attMtuList_.clear();
    }
    ~GattBase() = default;

protected:
    size_t getAttMtu(hal_ble_conn_handle_t connHandle) const {
        for (const auto& attMtu : attMtuList_) {
            if (attMtu.connHandle == connHandle) {
                return attMtu.effective;
            }
        }
        return 0;
    }

