particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
    void configureAttMtu(hal_ble_conn_handle_t connHandle, size_t effective, bool exchanged = false) {
        // Update the effective ATT_MTU if existed.
        for (auto& attMtu : attMtuList_) {
            if (attMtu.connHandle == connHandle) {
                attMtu.effective = effective;
                attMtu.isExchanged = exchanged;
                return;
            }
        }
        // Set ATT_MTU for new link.
        LinkAttMtu effectAttMtu;
        effectAttMtu.connHandle = connHandle;
        effectAttMtu.effective = effective;
        attMtuList_.append(effectAttMtu);
    }

    bool attMtuExchanged(hal_ble_conn_handle_t connHandle) const {
        for (const auto& attMtu : attMtuList_) {
            if (attMtu.connHandle == connHandle) {
                return attMtu.isExchanged;
            }
        }
        return false;
    }

    void clearAttMtu(hal_ble_conn_handle_t connHandle) {
        for (int i = 0; i < attMtuList_.size(); i = i) {
            const auto& attMtu = attMtuList_[i];
            if (attMtu.connHandle == connHandle) {
                attMtuList_.removeAt(i);
                continue;
            }
            i++;
        }
    }

    static uint8_t toHalCharProps(ble_gatt_char_props_t properties) {
        uint8_t halProperties = 0;
        if (properties.broadcast) {
            halProperties |= BLE_SIG_CHAR_PROP_BROADCAST;
        }
        if (properties.read) {
            halProperties |= BLE_SIG_CHAR_PROP_READ;
        }
        if (properties.write_wo_resp) {
            halProperties |= BLE_SIG_CHAR_PROP_WRITE_WO_RESP;
        }
        if (properties.write) {
            halProperties |= BLE_SIG_CHAR_PROP_WRITE;
        }
        if (properties.notify){
            halProperties |= BLE_SIG_CHAR_PROP_NOTIFY;
        }
        if (properties.indicate) {
            halProperties |= BLE_SIG_CHAR_PROP_INDICATE;
        }
        if (properties.auth_signed_wr) {
            halProperties |= BLE_SIG_CHAR_PROP_AUTH_SIGN_WRITES;
        }
        return halProperties;
    }

    static ble_gatt_char_props_t toPlatformCharProps(uint8_t halProperties) {
        ble_gatt_char_props_t properties = {};
        properties.broadcast = (halProperties & BLE_SIG_CHAR_PROP_BROADCAST) ? 1 : 0;
        properties.read = (halProperties & BLE_SIG_CHAR_PROP_READ) ? 1 : 0;
        properties.write_wo_resp = (halProperties & BLE_SIG_CHAR_PROP_WRITE_WO_RESP) ? 1 : 0;
        properties.write = (halProperties & BLE_SIG_CHAR_PROP_WRITE) ? 1 : 0;
        properties.notify = (halProperties & BLE_SIG_CHAR_PROP_NOTIFY) ? 1 : 0;
        properties.indicate = (halProperties & BLE_SIG_CHAR_PROP_INDICATE) ? 1 : 0;
        properties.auth_signed_wr = (halProperties & BLE_SIG_CHAR_PROP_AUTH_SIGN_WRITES) ? 1 : 0;
        return properties;
    }

    // GATT Server and GATT client share the same ATT_MTU.
    static size_t desiredAttMtu_;
    static Vector<LinkAttMtu> attMtuList_;
};

size_t GattBase::desiredAttMtu_ = BLE_MAX_ATT_MTU_SIZE;
Vector<GattBase::LinkAttMtu> GattBase::attMtuList_;

class BleObject {
public:
    class BleEventDispatcher;
    class BleGap;
    class Broadcaster;
    class Observer;
    class ConnectionsManager;
    class GattServer;
    class GattClient;

    static BleObject& getInstance();
    int init();
    int selectAntenna(hal_ble_ant_type_t antenna) const;

    BleEventDispatcher* dispatcher() { return dispatcher_.get(); }
    BleGap* gap() { return gap_.get(); }
    Broadcaster* broadcaster() { return broadcaster_.get(); }
    Observer* observer() { return observer_.get(); }
    ConnectionsManager* connMgr() { return connectionsMgr_.get(); }
    GattServer* gatts() { return gatts_.get(); }
    GattClient* gattc() { return gattc_.get(); }

private:
    BleObject() :
            dispatcher_(std::make_unique<BleEventDispatcher>()),
            gap_(std::make_unique<BleGap>()),
            broadcaster_(std::make_unique<Broadcaster>()),
            observer_(std::make_unique<Observer>()),
            connectionsMgr_(std::make_unique<ConnectionsManager>()),
            gatts_(std::make_unique<GattServer>()),
            gattc_(std::make_unique<GattClient>()) {
        init();
    }
    ~BleObject() = default;
    static int toPlatformUUID(const hal_ble_uuid_t* halUuid, ble_uuid_t* uuid);
    static int toHalUUID(const ble_uuid_t* uuid, hal_ble_uuid_t* halUuid);

    std::unique_ptr<BleEventDispatcher> dispatcher_;         /**< BLE event dispatcher. */
    std::unique_ptr<BleGap> gap_;                            /**< BLE GAP instance. */
    std::unique_ptr<Broadcaster> broadcaster_;               /**< BLE Broadcaster instance. */
    std::unique_ptr<Observer> observer_;                     /**< BLE Observer instance. */
    std::unique_ptr<ConnectionsManager> connectionsMgr_;     /**< BLE connections manager instance. */
    std::unique_ptr<GattServer> gatts_;                      /**< BLE GATT server instance. */
    std::unique_ptr<GattClient> gattc_;                      /**< BLE GATT client instance. */
    static bool initialized_;
};

class BleObject::BleEventDispatcher {
public:
    typedef void (*BleSpecificEventHandler)(void* data, void* context);

    class EventMessage {
    public:
        EventMessage() : handler(nullptr), context(nullptr), hook(nullptr), hookContext(nullptr) {
            evt = {};
        }
        ~EventMessage() = default;

        hal_ble_evts_t evt;                 /**< BLE event data. */
        BleSpecificEventHandler handler;    /**< BLE specific event handler. */
        void* context;                      /**< BLE specific event context. */
        on_ble_evt_cb_t hook;               /**< Internal hook function after event being dispatched. */
        void* hookContext;                  /**< Internal hook function context. */
    };

    BleEventDispatcher() : evtQueue_(nullptr), evtThread_(nullptr) {}
    ~BleEventDispatcher() = default;
    int init();
    int enqueue(EventMessage& msg);
    void onGenericEventCallback(on_ble_evt_cb_t cb, void* context);

