particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
private:
    class BleGenericEventHandler {
    public:
        BleGenericEventHandler() : handler(nullptr), context(nullptr) {}
        ~BleGenericEventHandler() = default;

        on_ble_evt_cb_t handler;
        void* context;
    };

    static os_thread_return_t bleEventDispatch(void* param);

    os_queue_t evtQueue_;                                   /**< BLE event queue. */
    os_thread_t evtThread_;                                 /**< BLE event thread. */
    Vector<BleGenericEventHandler> genericEventHandlers_;   /**< BLE generic event handlers. */
};

class BleObject::BleGap {
public:
    BleGap() = default;
    ~BleGap() = default;
    int init();
    int setDeviceName(const char* deviceName, size_t len);
    int getDeviceName(char* deviceName, size_t len);
    int setDeviceAddress(const hal_ble_addr_t* address);
    int getDeviceAddress(hal_ble_addr_t* address);
    int setAppearance(ble_sig_appearance_t appearance);
    int getAppearance(ble_sig_appearance_t* appearance);
    int addWhitelist(const hal_ble_addr_t* addrList, size_t len);
    int deleteWhitelist();

private:
    static void processBleGapEvents(const ble_evt_t* event, void* context);
};

class BleObject::Broadcaster {
public:
    Broadcaster();
    ~Broadcaster() = default;
    int init();
    bool advertising() const;
    int setAdvertisingParams(const hal_ble_adv_params_t* params);
    int getAdvertisingParams(hal_ble_adv_params_t* params) const;
    int setAdvertisingData(const uint8_t* buf, size_t len);
    ssize_t getAdvertisingData(uint8_t* buf, size_t len) const;
    int setScanResponseData(const uint8_t* buf, size_t len);
    ssize_t getScanResponseData(uint8_t* buf, size_t len) const;
    int setTxPower(int8_t val);
    int getTxPower(int8_t* txPower) const;
    int startAdvertising();
    int stopAdvertising();

private:
    int suspend();
    int resume();
    ble_gap_adv_data_t toPlatformAdvData(void);
    int configure(const hal_ble_adv_params_t* params);
    static int8_t roundTxPower(int8_t value);
    static ble_gap_adv_params_t toPlatformAdvParams(const hal_ble_adv_params_t* halParams);
    static void processBroadcasterEvents(const ble_evt_t* event, void* context);

    volatile bool isAdvertising_;                   /**< If it is advertising or not. */
    uint8_t advHandle_;                             /**< Advertising handle. */
    hal_ble_adv_params_t advParams_;                /**< Current advertising parameters. */
    uint8_t advData_[BLE_MAX_ADV_DATA_LEN];         /**< Current advertising data. */
    size_t advDataLen_;                             /**< Current advertising data length. */
    uint8_t scanRespData_[BLE_MAX_ADV_DATA_LEN];    /**< Current scan response data. */
    size_t scanRespDataLen_;                        /**< Current scan response data length. */
    int8_t txPower_;                                /**< TX Power. */
    bool advPending_;                               /**< Advertising is pending. */
    volatile hal_ble_conn_handle_t connHandle_;     /**< Connection handle. It is assigned once device is connected as Peripheral. It is used for re-start advertising. */
    static const int8_t validTxPower_[8];           /**< Valid TX power values. */
};

class BleObject::Observer {
public:
    Observer() :
            isScanning_(false),
            scanSemaphore_(nullptr),
            scanResultCallBack_(nullptr),
            context_(nullptr) {
        scanParams_.version = 0x01;
        scanParams_.active = true;
        scanParams_.filter_policy = BLE_SCAN_FP_ACCEPT_ALL;
        scanParams_.interval = BLE_DEFAULT_SCANNING_INTERVAL;
        scanParams_.window = BLE_DEFAULT_SCANNING_WINDOW;
        scanParams_.timeout = BLE_DEFAULT_SCANNING_TIMEOUT;
        bleScanData_.p_data = scanReportBuff_;
        bleScanData_.len = sizeof(scanReportBuff_);
    }
    ~Observer() = default;
    int init();
    bool scanning();
    int setScanParams(const hal_ble_scan_params_t* params);
    int getScanParams(hal_ble_scan_params_t* params) const;
    int startScanning(on_ble_scan_result_cb_t callback, void* context);
    int stopScanning();
    ble_gap_scan_params_t toPlatformScanParams(void) const;

private:
    bool cachedDevice(const hal_ble_addr_t& address) const;
    hal_ble_gap_on_scan_result_evt_t* cachedResult(const hal_ble_addr_t& address);
    void removeResult(const hal_ble_addr_t& address);
    void clearResult();
    int continueScanning();
    static void observerEventProcessedHook(const hal_ble_evts_t *event, void* context);
    static void processObserverEvents(const ble_evt_t* event, void* context);

    bool isScanning_;                                       /**< If it is scanning or not. */
    hal_ble_scan_params_t scanParams_;                      /**< BLE scanning parameters. */
    os_semaphore_t scanSemaphore_;                          /**< Semaphore to wait until the scan procedure completed. */
    uint8_t scanReportBuff_[BLE_MAX_SCAN_REPORT_BUF_LEN];   /**< Buffer to hold the scanned report data. */
    ble_data_t bleScanData_;                                /**< BLE scanned data. */
    Vector<hal_ble_addr_t> cache_;                          /**< Cached address of scanned devices to filter-out duplicated result. */
    Vector<hal_ble_gap_on_scan_result_evt_t> pendingResults_; /**< Caches the scanned advertising data until the scan response data is captured. */
    AtomicAllocedPool observerScannedDataPool_;             /**< Pool to allocate memory for scanned data. */
    on_ble_scan_result_cb_t scanResultCallBack_;            /**< Callback function on scan result. */
    void* context_;                                         /**< Context of the scan result callback function. */
};

class BleObject::ConnectionsManager {
public:
    struct BleConnection {
        uint8_t role;
        hal_ble_conn_handle_t connHandle;
        hal_ble_conn_params_t effectiveConnParams;
        hal_ble_addr_t peer;
    };

    ConnectionsManager() :
            isConnecting_(false),
            disconnectingHandle_(BLE_INVALID_CONN_HANDLE),
            connParamUpdateHandle_(BLE_INVALID_CONN_HANDLE),
            connParamsUpdateAttempts_(0),
            connParamsUpdateTimer_(nullptr),
            connParamsUpdateSemaphore_(nullptr),
            connectSemaphore_(nullptr),
            disconnectSemaphore_(nullptr) {
        connectingAddr_ = {};
        connections_.clear();
    }
    ~ConnectionsManager() = default;
    int init();
    int setPpcp(const hal_ble_conn_params_t* ppcp);
    int getPpcp(hal_ble_conn_params_t* ppcp) const;
    bool connecting(const hal_ble_addr_t* address) const;
    bool connected(const hal_ble_addr_t* address = nullptr);
    int connect(const hal_ble_addr_t* address);
    int connectCancel(const hal_ble_addr_t* address);
    int disconnect(hal_ble_conn_handle_t connHandle);
    int updateConnectionParams(hal_ble_conn_handle_t connHandle, const hal_ble_conn_params_t* params);
    int getConnectionParams(hal_ble_conn_handle_t connHandle, hal_ble_conn_params_t* params);
    bool valid(hal_ble_conn_handle_t connHandle);

