particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
private:
    BleConnection* fetchConnection(hal_ble_conn_handle_t connHandle);
    BleConnection* fetchConnection(const hal_ble_addr_t* address);
    void addConnection(const BleConnection& connection);
    void removeConnection(hal_ble_conn_handle_t connHandle);
    void initiateConnParamsUpdateIfNeeded(const BleConnection* connection);
    bool isConnParamsFeeded(const hal_ble_conn_params_t* params) const;
    static ble_gap_conn_params_t toPlatformConnParams(const hal_ble_conn_params_t* halConnParams);
    static hal_ble_conn_params_t toHalConnParams(const ble_gap_conn_params_t* params);
    static void onConnParamsUpdateTimerExpired(os_timer_t timer);
    static void processConnectionEvents(const ble_evt_t* event, void* context);

    bool isConnecting_;                             /**< If it is connecting or not. */
    hal_ble_addr_t connectingAddr_;                 /**< Address of peer the Central is connecting to. */
    volatile hal_ble_conn_handle_t disconnectingHandle_;     /**< Handle of connection to be disconnected. */
    volatile hal_ble_conn_handle_t connParamUpdateHandle_;   /**< Handle of the connection that is to send peripheral connection update request. */
    uint8_t connParamsUpdateAttempts_;              /**< Attempts for peripheral to update connection parameters. */
    os_timer_t connParamsUpdateTimer_;              /**< Timer used for sending peripheral connection update request after connection established. */
    os_semaphore_t connParamsUpdateSemaphore_;      /**< Semaphore to wait until connection parameters updated. */
    os_semaphore_t connectSemaphore_;               /**< Semaphore to wait until connection established. */
    os_semaphore_t disconnectSemaphore_;            /**< Semaphore to wait until connection disconnected. */
    Vector<BleConnection> connections_;             /**< Current on-going connections. */
};

class BleObject::GattServer : public GattBase {
public:
    GattServer() : hvxSemaphore_(nullptr) {}
    ~GattServer() = default;
    int init();
    int addService(uint8_t type, const hal_ble_uuid_t* uuid, hal_ble_attr_handle_t* svcHandle);
    int addCharacteristic(hal_ble_attr_handle_t svcHandle, uint8_t properties, const hal_ble_uuid_t* uuid, const char* desc, hal_ble_char_handles_t* charHandles);
    int addDescriptor(hal_ble_attr_handle_t charHandle, const hal_ble_uuid_t* uuid, uint8_t* descriptor, size_t len, hal_ble_attr_handle_t* descHandle);
    ssize_t setValue(hal_ble_attr_handle_t attrHandle, const uint8_t* buf, size_t len);
    ssize_t getValue(hal_ble_attr_handle_t attrHandle, uint8_t* buf, size_t len);

private:
    class BleCharacteristic {
        public:
            uint8_t properties;
            hal_ble_attr_handle_t svcHandle;
            hal_ble_char_handles_t charHandles;
            Vector<hal_ble_conn_handle_t> cccdConnections;
    };

    bool findService(hal_ble_attr_handle_t svcHandle) const;
    BleCharacteristic* findCharacteristic(hal_ble_attr_handle_t attrHandle);
    void addToCccdList(BleCharacteristic* characteristic, hal_ble_conn_handle_t connHandle);
    void removeFromCCCDList(BleCharacteristic* characteristic, hal_ble_conn_handle_t connHandle);
    void removeFromAllCCCDList(hal_ble_conn_handle_t connHandle);
    static void gattsEventProcessedHook(const hal_ble_evts_t *event, void* context);
    static void processGattServerEvents(const ble_evt_t* event, void* context);

    os_semaphore_t hvxSemaphore_;                   /**< Semaphore to wait until the HVX operation completed. */
    Vector<hal_ble_attr_handle_t> services_;        /**< Added services. */
    Vector<BleCharacteristic> characteristics_;     /**< Added characteristic. */
    AtomicAllocedPool gattsDataRecPool_;            /**< Pool to allocate memory for received data. */
};

class BleObject::GattClient : public GattBase {
public:
    GattClient() :
            isDiscovering_(false),
            currDiscConnHandle_(BLE_INVALID_CONN_HANDLE),
            currDiscProcedure_(DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_IDLE),
            discoverySemaphore_(nullptr),
            readWriteSemaphore_(nullptr),
            readAttrHandle_(BLE_INVALID_ATTR_HANDLE),
            readBuf_(nullptr),
            readLen_(0),
            attMtuExchangeConnHandle_(BLE_INVALID_CONN_HANDLE),
            attMtuExchangeTimer_(nullptr) {
        resetDiscoveryState();
    }
    ~GattClient() = default;
    int init();
    bool discovering(hal_ble_conn_handle_t connHandle) const;
    int discoverServices(hal_ble_conn_handle_t connHandle, const hal_ble_uuid_t* uuid, on_ble_disc_service_cb_t callback, void* context);
    int discoverCharacteristics(hal_ble_conn_handle_t connHandle, const hal_ble_svc_t* service, on_ble_disc_char_cb_t callback, void* context);
    int setDesiredAttMtu(size_t attMtu);
    ssize_t writeAttribute(hal_ble_conn_handle_t connHandle, hal_ble_attr_handle_t attrHandle, const uint8_t* buf, size_t len, bool response);
    ssize_t readAttribute(hal_ble_conn_handle_t connHandle, hal_ble_attr_handle_t attrHandle, uint8_t* buf, size_t len);

private:
    enum class DiscoveryProcedure {
        BLE_DISCOVERY_PROCEDURE_IDLE = 0,
        BLE_DISCOVERY_PROCEDURE_SERVICES = 1,
        BLE_DISCOVERY_PROCEDURE_CHARACTERISTICS = 2,
        BLE_DISCOVERY_PROCEDURE_DESCRIPTORS = 3,
    };

    void resetDiscoveryState();
    bool readServiceUUID128IfNeeded() const;
    bool readCharacteristicUUID128IfNeeded() const;
    hal_ble_svc_t* findDiscoveredService(hal_ble_attr_handle_t attrHandle);
    hal_ble_char_t* findDiscoveredCharacteristic(hal_ble_attr_handle_t attrHandle);
    static void onAttMtuExchangeTimerExpired(os_timer_t timer);
    static void gattcEventProcessedHook(const hal_ble_evts_t *event, void* context);
    static void processGattClientEvents(const ble_evt_t* event, void* context);

    bool discoverAll_;                                  /**< If it is going to discover all service during the service discovery procedure. */
    bool isDiscovering_;                                /**< If there is on-going discovery procedure. */
    hal_ble_conn_handle_t currDiscConnHandle_;          /**< Current connection handle under which the service and characteristics to be discovered. */
    DiscoveryProcedure currDiscProcedure_;              /**< Current discovery procedure. */
    hal_ble_svc_t currDiscSvc_;                         /**< Current service to be discovered for the characteristics. */
    os_semaphore_t discoverySemaphore_;                 /**< Semaphore to wait until the discovery procedure completed. */
    os_semaphore_t readWriteSemaphore_;                 /**< Semaphore to wait until the read or write operation completed. */
    Vector<hal_ble_svc_t> discoveredServices_;          /**< Discover services. */
    Vector<hal_ble_char_t> discoveredCharacteristics_;  /**< Discovered characteristics. */
    hal_ble_attr_handle_t readAttrHandle_;              /**< Current handle of which attribute to be read. */
    uint8_t* readBuf_;                                  /**< Current buffer to be filled for the read data. */
    size_t readLen_;                                    /**< Length of read data. */
    AtomicAllocedPool gattcDataRecPool_;                /**< Pool to allocate memory for received data. */
    volatile hal_ble_conn_handle_t attMtuExchangeConnHandle_;    /**< Current handle of the connection to execute ATT_MTU exchange procedure. */
    os_timer_t attMtuExchangeTimer_;                    /**< Timer used for sending the exchanging ATT_MTU request after connection established. */
};

int BleObject::BleEventDispatcher::init() {
    genericEventHandlers_.clear();
    if (os_queue_create(&evtQueue_, sizeof(EventMessage), BLE_EVENT_QUEUE_ITEM_COUNT, nullptr)) {
        LOG(ERROR, "os_queue_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }
    if (os_thread_create(&evtThread_, "BLE Event Thread", OS_THREAD_PRIORITY_NETWORK, bleEventDispatch, this, BLE_EVENT_THREAD_STACK_SIZE)) {
        LOG(ERROR, "os_thread_create() failed");
        os_queue_destroy(evtQueue_, nullptr);
        return SYSTEM_ERROR_INTERNAL;
    }
    return SYSTEM_ERROR_NONE;
}

int BleObject::BleEventDispatcher::enqueue(EventMessage& msg) {
    if (os_queue_put(evtQueue_, &msg, 0, nullptr)) {
        LOG(ERROR, "os_queue_put() failed.");
        // Free the memory if needed.
        if (msg.hook && msg.hookContext) {
            msg.hook(&msg.evt, msg.hookContext);
        }
        return SYSTEM_ERROR_NO_MEMORY;
    }
    return SYSTEM_ERROR_NONE;
}

void BleObject::BleEventDispatcher::onGenericEventCallback(on_ble_evt_cb_t cb, void* context) {
    BleGenericEventHandler evtHandler;
    evtHandler.handler = cb;
    evtHandler.context = context;
    genericEventHandlers_.append(evtHandler);
}

os_thread_return_t BleObject::BleEventDispatcher::bleEventDispatch(void* param) {
    BleEventDispatcher* dispatcher = static_cast<BleEventDispatcher*>(param);
    while (1) {
        EventMessage msg;
        if (!os_queue_take(dispatcher->evtQueue_, &msg, CONCURRENT_WAIT_FOREVER, nullptr)) {
            if (msg.handler) {
                // Invoke the handler registered by specific application.
                if (msg.evt.type == BLE_EVT_SCAN_RESULT) {
                    msg.handler(&msg.evt.params.scan_result, msg.context);
                } else if (msg.evt.type == BLE_EVT_SVC_DISCOVERED) {
                    msg.handler(&msg.evt.params.svc_disc, msg.context);
                } else if (msg.evt.type == BLE_EVT_CHAR_DISCOVERED) {
                    msg.handler(&msg.evt.params.char_disc, msg.context);
                }
            } else {
                // Just dispatch the event to the application those have subscribed the generic events.
                for (auto& evtHandler : dispatcher->genericEventHandlers_) {
                    if (evtHandler.handler) {
                        evtHandler.handler(&msg.evt, evtHandler.context);
                    }
                }
            }
            // Free the memory if needed.
            if (msg.hook) {
                msg.hook(&msg.evt, msg.hookContext);
            }
        } else {
            LOG(ERROR, "BLE event thread exited.");
            break;
        }
    }
    os_thread_exit(dispatcher->evtThread_);
}

struct BleGapImpl {
    BleObject::BleGap* instance;
};
