particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
int BleObject::Broadcaster::getTxPower(int8_t* txPower) const {
    if (txPower == nullptr) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    *txPower = txPower_;
    return SYSTEM_ERROR_NONE;
}

int BleObject::Broadcaster::startAdvertising() {
    CHECK(stopAdvertising());
    int ret = sd_ble_gap_adv_start(advHandle_, BLE_CONN_CFG_TAG);
    CHECK_NRF_RETURN(ret, sysError(ret));
    isAdvertising_ = true;
    return SYSTEM_ERROR_NONE;
}

int BleObject::Broadcaster::stopAdvertising() {
    if (isAdvertising_) {
        int ret = sd_ble_gap_adv_stop(advHandle_);
        CHECK_NRF_RETURN(ret, sysError(ret));
        isAdvertising_ = false;
    }
    return SYSTEM_ERROR_NONE;
}

int BleObject::Broadcaster::suspend() {
    CHECK(stopAdvertising());
    advPending_ = true;
    return SYSTEM_ERROR_NONE;
}

int BleObject::Broadcaster::resume() {
    if (advPending_) {
        CHECK(startAdvertising());
        advPending_ = false;
    }
    return SYSTEM_ERROR_NONE;
}

ble_gap_adv_params_t BleObject::Broadcaster::toPlatformAdvParams(const hal_ble_adv_params_t* halParams) {
    ble_gap_adv_params_t params = {};
    params.properties.type = BleAdvEvtTypeMap[halParams->type];
    params.properties.include_tx_power = false; // FIXME: for extended advertising packet
    params.p_peer_addr = nullptr;
    params.interval = halParams->interval;
    params.duration = halParams->timeout;
    params.filter_policy = halParams->filter_policy;
    params.primary_phy = BLE_GAP_PHY_1MBPS;
    return params;
}

ble_gap_adv_data_t BleObject::Broadcaster::toPlatformAdvData(void) {
    ble_gap_adv_data_t advData = {};
    advData.adv_data.p_data = advData_;
    advData.adv_data.len = advDataLen_;
    advData.scan_rsp_data.p_data = scanRespData_;
    advData.scan_rsp_data.len = scanRespDataLen_;
    return advData;
}

int BleObject::Broadcaster::configure(const hal_ble_adv_params_t* params) {
    int ret;
    ble_gap_adv_data_t bleGapAdvData = toPlatformAdvData();
    if (params == nullptr) {
        ret = sd_ble_gap_adv_set_configure(&advHandle_, &bleGapAdvData, nullptr);
    } else {
        ble_gap_adv_params_t bleGapAdvParams = toPlatformAdvParams(params);
        LOG_DEBUG(TRACE, "BLE advertising interval: %.3fms, timeout: %dms.",
                  bleGapAdvParams.interval*0.625, bleGapAdvParams.duration*10);
        ret = sd_ble_gap_adv_set_configure(&advHandle_, &bleGapAdvData, &bleGapAdvParams);
    }
    CHECK_NRF_RETURN(ret, sysError(ret));
    return SYSTEM_ERROR_NONE;
}

int8_t BleObject::Broadcaster::roundTxPower(int8_t value) {
    for (const auto& txPower : validTxPower_) {
        if (value <= txPower) {
            return txPower;
        }
    }
    return BLE_MAX_TX_POWER;
}

void BleObject::Broadcaster::processBroadcasterEvents(const ble_evt_t* event, void* context) {
    Broadcaster* broadcaster = static_cast<BroadcasterImpl*>(context)->instance;
    switch (event->header.evt_id) {
        case BLE_GAP_EVT_ADV_SET_TERMINATED: {
            LOG_DEBUG(TRACE, "BLE GAP event: advertising stopped.");
            broadcaster->isAdvertising_ = false;
            BleObject::BleEventDispatcher::EventMessage msg;
            msg.evt.version = BLE_API_VERSION;
            msg.evt.size = sizeof(hal_ble_evts_t);
            msg.evt.type = BLE_EVT_ADV_STOPPED;
            msg.evt.params.adv_stopped.reserved = nullptr;
            BleObject::getInstance().dispatcher()->enqueue(msg);
            break;
        }
        case BLE_GAP_EVT_CONNECTED: {
            // FIXME: If multi role is enabled, this flag should not be clear here.
            broadcaster->isAdvertising_ = false;
            if (event->evt.gap_evt.params.connected.role == BLE_ROLE_PERIPHERAL) {
                broadcaster->connHandle_ = event->evt.gap_evt.conn_handle;
            }
            break;
        }
        case BLE_GAP_EVT_DISCONNECTED: {
            // Re-start advertising.
            // FIXME: when multi-role implemented.
            if (broadcaster->connHandle_ == event->evt.gap_evt.conn_handle) {
                LOG_DEBUG(TRACE, "Restart BLE advertising.");
                broadcaster->startAdvertising();
                broadcaster->connHandle_ = BLE_INVALID_CONN_HANDLE;
            }
            break;
        }
        default: {
            break;
        }
    }
}

const int8_t BleObject::Broadcaster::validTxPower_[8] = { -20, -16, -12, -8, -4, 0, 4, BLE_MAX_TX_POWER };

struct ObserverImpl {
    BleObject::Observer* instance;
};
static ObserverImpl observerImpl;

int BleObject::Observer::init() {
    scanParams_.size = sizeof(hal_ble_scan_params_t);
    observerScannedDataPool_.init(OBSERVER_SCANNED_DATA_POOL_SIZE);
    observerImpl.instance = this;
    NRF_SDH_BLE_OBSERVER(bleObserver, 1, processObserverEvents, &observerImpl);
    return SYSTEM_ERROR_NONE;
}

bool BleObject::Observer::scanning() {
    return isScanning_;
}

int BleObject::Observer::setScanParams(const hal_ble_scan_params_t* params) {
    if (params == nullptr) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if ((params->interval < BLE_GAP_SCAN_INTERVAL_MIN) ||
            (params->interval > BLE_GAP_SCAN_INTERVAL_MAX) ||
            (params->window < BLE_GAP_SCAN_WINDOW_MIN) ||
            (params->window > BLE_GAP_SCAN_WINDOW_MAX) ||
            (params->window > params->interval) ) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    scanParams_.size = sizeof(hal_ble_scan_params_t);
    memcpy(&scanParams_, params, scanParams_.size);
    scanParams_.version = BLE_API_VERSION;
    return SYSTEM_ERROR_NONE;
}

int BleObject::Observer::getScanParams(hal_ble_scan_params_t* params) const {
    if (params == nullptr) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    memcpy(params, &scanParams_, params->size);
    return SYSTEM_ERROR_NONE;
}

int BleObject::Observer::continueScanning() {
    int ret = sd_ble_gap_scan_start(nullptr, &bleScanData_);
    CHECK_NRF_RETURN(ret, sysError(ret));
    return SYSTEM_ERROR_NONE;
}

int BleObject::Observer::startScanning(on_ble_scan_result_cb_t callback, void* context) {
    if (isScanning_) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    if (os_semaphore_create(&scanSemaphore_, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }
    SCOPE_GUARD ({
        os_semaphore_destroy(scanSemaphore_);
        scanSemaphore_ = nullptr;
    });
    ble_gap_scan_params_t bleGapScanParams = toPlatformScanParams();
    LOG_DEBUG(TRACE, "| interval(ms)   window(ms)   timeout(ms) |");
    LOG_DEBUG(TRACE, "  %.3f        %.3f      %d",
            bleGapScanParams.interval*0.625, bleGapScanParams.window*0.625, bleGapScanParams.timeout*10);
    cache_.clear();
    scanResultCallBack_ = callback;
    context_ = context;
    int ret = sd_ble_gap_scan_start(&bleGapScanParams, &bleScanData_);
    CHECK_NRF_RETURN(ret, sysError(ret));
    isScanning_ = true;
    ret = SYSTEM_ERROR_NONE;
    if (os_semaphore_take(scanSemaphore_, CONCURRENT_WAIT_FOREVER, false)) {
        ret = SYSTEM_ERROR_TIMEOUT;
    }
    isScanning_ = false;
    cache_.clear();
    clearResult();
    return ret;
}

