particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
int BleObject::Observer::stopScanning() {
    if (!isScanning_) {
        return SYSTEM_ERROR_NONE;
    }
    int ret = sd_ble_gap_scan_stop();
    CHECK_NRF_RETURN(ret, sysError(ret));
    if (scanSemaphore_) {
        os_semaphore_give(scanSemaphore_, false);
    }
    return SYSTEM_ERROR_NONE;
}

ble_gap_scan_params_t BleObject::Observer::toPlatformScanParams(void) const {
    ble_gap_scan_params_t params = {};
    params.extended = 0;
    params.active = scanParams_.active;
    params.interval = scanParams_.interval;
    params.window = scanParams_.window;
    params.timeout = scanParams_.timeout;
    params.scan_phys = BLE_GAP_PHY_1MBPS;
    params.filter_policy = scanParams_.filter_policy;
    return params;
}

bool BleObject::Observer::cachedDevice(const hal_ble_addr_t& address) const {
    for (const auto& addr : cache_) {
        if (addressEqual(addr, address)) {
            return true;
        }
    }
    return false;
}

hal_ble_gap_on_scan_result_evt_t* BleObject::Observer::cachedResult(const hal_ble_addr_t& address) {
    for (auto& result : pendingResults_) {
        if (addressEqual(result.peer_addr, address)) {
            return &result;
        }
    }
    return nullptr;
}

void BleObject::Observer::removeResult(const hal_ble_addr_t& address) {
    for (int i = 0; i < pendingResults_.size(); i = i) {
        const auto& result = pendingResults_[i];
        if (addressEqual(result.peer_addr, address)) {
            pendingResults_.removeAt(i);
            continue;
        }
        i++;
    }
}

void BleObject::Observer::clearResult() {
    for (const auto& result : pendingResults_) {
        if (result.adv_data != nullptr) {
            observerScannedDataPool_.free(result.adv_data);
            LOG_DEBUG(TRACE, "clearResult: Free Scanned adv_data memory: %u", (unsigned)result.adv_data);
        }
    }
    pendingResults_.clear();
}

void BleObject::Observer::observerEventProcessedHook(const hal_ble_evts_t *event, void* context) {
    Observer* observer = static_cast<Observer*>(context);
    if (observer && event && event->type == BLE_EVT_SCAN_RESULT) {
        if (event->params.scan_result.adv_data != nullptr) {
            observer->observerScannedDataPool_.free(event->params.scan_result.adv_data);
            LOG_DEBUG(TRACE, "Hook: Free Scanned adv_data memory: %u", (unsigned)event->params.scan_result.adv_data);
        }
        if (event->params.scan_result.sr_data != nullptr) {
            observer->observerScannedDataPool_.free(event->params.scan_result.sr_data);
            LOG_DEBUG(TRACE, "Hook: Free Scanned sr_data memory: %u", (unsigned)event->params.scan_result.sr_data);
        }
    }
}

void BleObject::Observer::processObserverEvents(const ble_evt_t* event, void* context) {
    Observer* observer = static_cast<ObserverImpl*>(context)->instance;
    switch (event->header.evt_id) {
        case BLE_GAP_EVT_ADV_REPORT: {
            const ble_gap_evt_adv_report_t& advReport = event->evt.gap_evt.params.adv_report;
            hal_ble_addr_t newAddr;
            newAddr.addr_type = (ble_sig_addr_type_t)advReport.peer_addr.addr_type;
            memcpy(newAddr.addr, advReport.peer_addr.addr, BLE_SIG_ADDR_LEN);
            if (!observer->cachedDevice(newAddr)) {
                if (!observer->scanParams_.active || !advReport.type.scannable) {
                    observer->cache_.append(newAddr);
                    uint8_t* advData = (uint8_t*)observer->observerScannedDataPool_.alloc(advReport.data.len);
                    if (advData) {
                        LOG_DEBUG(TRACE, "Scanned adv_data address: %u, len: %u", (unsigned)advData, advReport.data.len);
                        BleObject::BleEventDispatcher::EventMessage msg;
                        msg.evt.type = BLE_EVT_SCAN_RESULT;
                        msg.evt.version = BLE_API_VERSION;
                        msg.evt.size = sizeof(hal_ble_evts_t);
                        msg.evt.params.scan_result.type.connectable = advReport.type.connectable;
                        msg.evt.params.scan_result.type.scannable = advReport.type.scannable;
                        msg.evt.params.scan_result.type.directed = advReport.type.directed;
                        msg.evt.params.scan_result.type.extended_pdu = advReport.type.extended_pdu;
                        msg.evt.params.scan_result.rssi = advReport.rssi;
                        msg.evt.params.scan_result.peer_addr.addr_type = (ble_sig_addr_type_t)advReport.peer_addr.addr_type;
                        memcpy(msg.evt.params.scan_result.peer_addr.addr, advReport.peer_addr.addr, BLE_SIG_ADDR_LEN);
                        msg.evt.params.scan_result.adv_data_len = advReport.data.len;
                        memcpy(advData, advReport.data.p_data, advReport.data.len);
                        msg.evt.params.scan_result.adv_data = advData;
                        msg.handler = (BleObject::BleEventDispatcher::BleSpecificEventHandler)observer->scanResultCallBack_;
                        msg.context = observer->context_;
                        msg.hook = observer->observerEventProcessedHook;
                        msg.hookContext = observer;
                        BleObject::getInstance().dispatcher()->enqueue(msg);
                    }
                } else if (advReport.type.scannable) {
                    if (!advReport.type.scan_response) {
                        if (observer->cachedResult(newAddr) == nullptr) {
                            uint8_t* advData = (uint8_t*)observer->observerScannedDataPool_.alloc(advReport.data.len);
                            if (advData) {
                                LOG_DEBUG(TRACE, "Cached adv_data address: %u, len: %u", (unsigned)advData, advReport.data.len);
                                hal_ble_gap_on_scan_result_evt_t result = {};
                                result.type.connectable = advReport.type.connectable;
                                result.type.scannable = advReport.type.scannable;
                                result.type.directed = advReport.type.directed;
                                result.type.extended_pdu = advReport.type.extended_pdu;
                                result.rssi = advReport.rssi;
                                result.peer_addr.addr_type = newAddr.addr_type;
                                memcpy(result.peer_addr.addr, newAddr.addr, BLE_SIG_ADDR_LEN);
                                result.adv_data_len = advReport.data.len;
                                memcpy(advData, advReport.data.p_data, advReport.data.len);
                                result.adv_data = advData;
                                observer->pendingResults_.append(result);
                            }
                        }
                    } else {
                        hal_ble_gap_on_scan_result_evt_t* result = observer->cachedResult(newAddr);
                        if (result) {
                            result->rssi = advReport.rssi;
                            result->sr_data = nullptr;
                            result->sr_data_len = advReport.data.len;
                            if (advReport.data.len > 0) {
                                uint8_t* srData = (uint8_t*)observer->observerScannedDataPool_.alloc(advReport.data.len);
                                if (srData) {
                                    LOG_DEBUG(TRACE, "Scanned sr_data address: %u, len: %u", (unsigned)srData, advReport.data.len);
                                    memcpy(srData, advReport.data.p_data, advReport.data.len);
                                    result->sr_data = srData;
                                } else {
                                    result->sr_data_len = 0;
                                }
                            }
                            BleObject::BleEventDispatcher::EventMessage msg;
                            msg.evt.type = BLE_EVT_SCAN_RESULT;
                            msg.evt.params.scan_result = *result;
                            msg.handler = (BleObject::BleEventDispatcher::BleSpecificEventHandler)observer->scanResultCallBack_;
                            msg.context = observer->context_;
                            msg.hook = observer->observerEventProcessedHook;
                            msg.hookContext = observer;
                            BleObject::getInstance().dispatcher()->enqueue(msg);
                            observer->removeResult(newAddr);
                            observer->cache_.append(newAddr);
                        }
                    }
                }
            }
            // Continue scanning
            observer->continueScanning();
            break;
        }
        case BLE_GAP_EVT_TIMEOUT: {
            if (event->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_SCAN) {
                LOG_DEBUG(TRACE, "BLE GAP event: Scanning timeout");
                if (observer->scanSemaphore_) {
                    os_semaphore_give(observer->scanSemaphore_, false);
                }
            }
            break;
        }
        default: {
            break;
        }
    }
}

