particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
struct ConnectionsManagerImpl {
    BleObject::ConnectionsManager* instance;
};
static ConnectionsManagerImpl connMgrImpl;

int BleObject::ConnectionsManager::init() {
    /*
     * Default Peripheral Preferred Connection Parameters.
     * For BLE Central, this is the initial connection parameters.
     * For BLE Peripheral, this is the Peripheral Preferred Connection Parameters.
     */
    ble_gap_conn_params_t bleGapConnParams = {};
    bleGapConnParams.min_conn_interval = BLE_DEFAULT_MIN_CONN_INTERVAL;
    bleGapConnParams.max_conn_interval = BLE_DEFAULT_MAX_CONN_INTERVAL;
    bleGapConnParams.slave_latency = BLE_DEFAULT_SLAVE_LATENCY;
    bleGapConnParams.conn_sup_timeout = BLE_DEFAULT_CONN_SUP_TIMEOUT;
    int ret = sd_ble_gap_ppcp_set(&bleGapConnParams);
    CHECK_NRF_RETURN(ret, sysError(ret));
    if (os_timer_create(&connParamsUpdateTimer_, BLE_CONN_PARAMS_UPDATE_DELAY_MS, onConnParamsUpdateTimerExpired, this, true, nullptr)) {
        LOG(ERROR, "os_timer_create() failed.");
        connParamsUpdateTimer_ = nullptr;
        return SYSTEM_ERROR_INTERNAL;
    }
    connMgrImpl.instance = this;
    NRF_SDH_BLE_OBSERVER(bleConnectionManager, 1, processConnectionEvents, &connMgrImpl);
    return SYSTEM_ERROR_NONE;
}

int BleObject::ConnectionsManager::setPpcp(const hal_ble_conn_params_t* ppcp) {
    if (ppcp == nullptr) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if ((ppcp->min_conn_interval != BLE_SIG_CP_MIN_CONN_INTERVAL_NONE) &&
            (ppcp->min_conn_interval < BLE_SIG_CP_MIN_CONN_INTERVAL_MIN ||
             ppcp->min_conn_interval > BLE_SIG_CP_MIN_CONN_INTERVAL_MAX)) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if ((ppcp->max_conn_interval != BLE_SIG_CP_MAX_CONN_INTERVAL_NONE) &&
            (ppcp->max_conn_interval < BLE_SIG_CP_MAX_CONN_INTERVAL_MIN ||
             ppcp->max_conn_interval > BLE_SIG_CP_MAX_CONN_INTERVAL_MAX)) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (ppcp->slave_latency > BLE_SIG_CP_SLAVE_LATENCY_MAX) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if ((ppcp->conn_sup_timeout != BLE_SIG_CP_CONN_SUP_TIMEOUT_NONE) &&
            (ppcp->conn_sup_timeout < BLE_SIG_CP_CONN_SUP_TIMEOUT_MIN ||
             ppcp->conn_sup_timeout > BLE_SIG_CP_CONN_SUP_TIMEOUT_MAX)) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    ble_gap_conn_params_t bleGapConnParams = toPlatformConnParams(ppcp);
    int ret = sd_ble_gap_ppcp_set(&bleGapConnParams);
    CHECK_NRF_RETURN(ret, sysError(ret));
    return SYSTEM_ERROR_NONE;
}

int BleObject::ConnectionsManager::getPpcp(hal_ble_conn_params_t* ppcp) const {
    if (ppcp == nullptr) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    ble_gap_conn_params_t bleGapConnParams = {};
    int ret = sd_ble_gap_ppcp_get(&bleGapConnParams);
    CHECK_NRF_RETURN(ret, sysError(ret));
    *ppcp = toHalConnParams(&bleGapConnParams);
    return SYSTEM_ERROR_NONE;
}

bool BleObject::ConnectionsManager::connecting(const hal_ble_addr_t* address) const {
    // TODO: several links are being established concurrently.
    return isConnecting_;
}

bool BleObject::ConnectionsManager::connected(const hal_ble_addr_t* address) {
    if (address == nullptr) {
        return connections_.size() > 0;
    } else if (fetchConnection(address)) {
        return true;
    }
    return false;
}

int BleObject::ConnectionsManager::connect(const hal_ble_addr_t* address) {
    // Stop scanning first to give the scanning semaphore if possible.
    int ret;
    CHECK(BleObject::getInstance().observer()->stopScanning());
    if (os_semaphore_create(&connectSemaphore_, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }
    SCOPE_GUARD({
        os_semaphore_destroy(connectSemaphore_);
        connectSemaphore_ = nullptr;
    });
    ble_gap_addr_t bleDevAddr = {};
    bleDevAddr.addr_type = address->addr_type;
    memcpy(bleDevAddr.addr, address->addr, BLE_SIG_ADDR_LEN);
    ble_gap_scan_params_t bleGapScanParams = BleObject::getInstance().observer()->toPlatformScanParams();
    ble_gap_conn_params_t bleGapConnParams = {};
    ret = sd_ble_gap_ppcp_get(&bleGapConnParams);
    CHECK_NRF_RETURN(ret, sysError(ret));
    ret = sd_ble_gap_connect(&bleDevAddr, &bleGapScanParams, &bleGapConnParams, BLE_CONN_CFG_TAG);
    if (ret != NRF_SUCCESS) {
        CHECK_NRF_RETURN(ret, sysError(ret));
    }
    isConnecting_ = true;
    memcpy(&connectingAddr_, address, sizeof(hal_ble_addr_t));
    ret = SYSTEM_ERROR_NONE;
    if (os_semaphore_take(connectSemaphore_, CONNECTION_OPERATION_TIMEOUT_MS, false)) {
        ret = SYSTEM_ERROR_TIMEOUT;
    }
    isConnecting_ = false;
    connectingAddr_ = {};
    return ret;
}

int BleObject::ConnectionsManager::connectCancel(const hal_ble_addr_t* address) {
    if (isConnecting_) {
        int ret = sd_ble_gap_connect_cancel();
        CHECK_NRF_RETURN(ret, sysError(ret));
        if (connectSemaphore_) {
            os_semaphore_give(connectSemaphore_, false);
        }
    }
    return SYSTEM_ERROR_NONE;
}

int BleObject::ConnectionsManager::disconnect(hal_ble_conn_handle_t connHandle) {
    if (fetchConnection(connHandle) == nullptr) {
        return SYSTEM_ERROR_NOT_FOUND;
    }
    if (os_semaphore_create(&disconnectSemaphore_, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }
    SCOPE_GUARD({
        os_semaphore_destroy(disconnectSemaphore_);
        disconnectSemaphore_ = nullptr;
    });
    int ret = sd_ble_gap_disconnect(connHandle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    if (ret != NRF_SUCCESS) {
        CHECK_NRF_RETURN(ret, sysError(ret));
    }
    disconnectingHandle_ = connHandle;
    ret = SYSTEM_ERROR_NONE;
    if (os_semaphore_take(disconnectSemaphore_, CONNECTION_OPERATION_TIMEOUT_MS, false)) {
        ret = SYSTEM_ERROR_TIMEOUT;
    }
    disconnectingHandle_ = BLE_INVALID_CONN_HANDLE;
    return ret;
}

int BleObject::ConnectionsManager::updateConnectionParams(hal_ble_conn_handle_t connHandle, const hal_ble_conn_params_t* params) {
    int ret;
    if (fetchConnection(connHandle) == nullptr) {
        return SYSTEM_ERROR_NOT_FOUND;
    }
    if (os_semaphore_create(&connParamsUpdateSemaphore_, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }
    SCOPE_GUARD({
        os_semaphore_destroy(connParamsUpdateSemaphore_);
        connParamsUpdateSemaphore_ = nullptr;
    });
    ble_gap_conn_params_t bleGapConnParams = {};
    if (params == nullptr) {
        // Use the PPCP characteristic value as the connection parameters.
        ret = sd_ble_gap_ppcp_get(&bleGapConnParams);
        CHECK_NRF_RETURN(ret, sysError(ret));
    } else {
        bleGapConnParams = toPlatformConnParams(params);
    }
    // For Central role, this will initiate the connection parameter update procedure.
    // For Peripheral role, this will use the passed in parameters and send the request to central.
    ret = sd_ble_gap_conn_param_update(connHandle, &bleGapConnParams);
    if (ret != NRF_SUCCESS) {
        CHECK_NRF_RETURN(ret, sysError(ret));
    }
    connParamUpdateHandle_ = connHandle;
    ret = SYSTEM_ERROR_NONE;
    if (os_semaphore_take(connParamsUpdateSemaphore_, CONNECTION_OPERATION_TIMEOUT_MS, false)) {
        ret = SYSTEM_ERROR_TIMEOUT;
    }
    connParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
    return ret;
}

int BleObject::ConnectionsManager::getConnectionParams(hal_ble_conn_handle_t connHandle, hal_ble_conn_params_t* params) {
    const BleConnection* connection = fetchConnection(connHandle);
    if (connection == nullptr) {
        return SYSTEM_ERROR_NOT_FOUND;
    }
    memcpy(params, &connection->effectiveConnParams, params->size);
    return SYSTEM_ERROR_NONE;
}

bool BleObject::ConnectionsManager::valid(hal_ble_conn_handle_t connHandle) {
    const BleConnection* connection = fetchConnection(connHandle);
    return connection != nullptr;
}

ble_gap_conn_params_t BleObject::ConnectionsManager::toPlatformConnParams(const hal_ble_conn_params_t* halConnParams) {
    ble_gap_conn_params_t params = {};
    params.min_conn_interval = halConnParams->min_conn_interval;
    params.max_conn_interval = halConnParams->max_conn_interval;
    params.slave_latency = halConnParams->slave_latency;
    params.conn_sup_timeout = halConnParams->conn_sup_timeout;
    return params;
}

hal_ble_conn_params_t BleObject::ConnectionsManager::toHalConnParams(const ble_gap_conn_params_t* params) {
    hal_ble_conn_params_t halConnParams = {};
    halConnParams.version = BLE_API_VERSION;
    halConnParams.size = sizeof(hal_ble_conn_params_t);
    halConnParams.min_conn_interval = params->min_conn_interval;
    halConnParams.max_conn_interval = params->max_conn_interval;
    halConnParams.slave_latency = params->slave_latency;
    halConnParams.conn_sup_timeout = params->conn_sup_timeout;
    return halConnParams;
}

