particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
bool BleObject::GattClient::discovering(hal_ble_conn_handle_t connHandle) const {
    // TODO: discovering service and characteristic on multi-links concurrently.
    return isDiscovering_;
}

int BleObject::GattClient::discoverServices(hal_ble_conn_handle_t connHandle, const hal_ble_uuid_t* uuid, on_ble_disc_service_cb_t callback, void* context) {
    int ret;
    if (!BleObject::getInstance().connMgr()->valid(connHandle)) {
        LOG(ERROR, "Connection invalid.");
        return SYSTEM_ERROR_NOT_FOUND;
    }
    if (isDiscovering_) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    if (os_semaphore_create(&discoverySemaphore_, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }
    SCOPE_GUARD({
        os_semaphore_destroy(discoverySemaphore_);
        discoverySemaphore_ = nullptr;
    });
    currDiscConnHandle_ = connHandle;
    currDiscProcedure_ = DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_SERVICES;
    if (uuid == nullptr) {
        discoverAll_ = true;
        ret = sd_ble_gattc_primary_services_discover(connHandle, SERVICES_BASE_START_HANDLE, nullptr);
    } else {
        ble_uuid_t svcUUID;
        BleObject::toPlatformUUID(uuid, &svcUUID);
        ret = sd_ble_gattc_primary_services_discover(connHandle, SERVICES_BASE_START_HANDLE, &svcUUID);
    }
    if (ret != NRF_SUCCESS) {
        resetDiscoveryState();
        CHECK_NRF_RETURN(ret, sysError(ret));
    }
    isDiscovering_ = true;
    ret = SYSTEM_ERROR_NONE;
    if (os_semaphore_take(discoverySemaphore_, BLE_DICOVERY_PROCEDURE_TIMEOUT_MS, false)) {
        ret = SYSTEM_ERROR_TIMEOUT;
    }
    hal_ble_svc_t* services = (hal_ble_svc_t*)malloc(discoveredServices_.size() * sizeof(hal_ble_svc_t));
    if (services) {
        LOG_DEBUG(TRACE, "Discovered services address: %u, len: %u", (unsigned)services, discoveredServices_.size() * sizeof(hal_ble_svc_t));
        BleObject::BleEventDispatcher::EventMessage msg;
        msg.evt.type = BLE_EVT_SVC_DISCOVERED;
        msg.evt.version = BLE_API_VERSION;
        msg.evt.size = sizeof(hal_ble_evts_t);
        msg.evt.params.svc_disc.conn_handle = currDiscConnHandle_;
        msg.evt.params.svc_disc.count = discoveredServices_.size();
        size_t i = 0;
        for (const auto& service : discoveredServices_) {
            memcpy(services + i, &service, service.size);
            i++;
        }
        msg.evt.params.svc_disc.services = services;
        msg.handler = (BleObject::BleEventDispatcher::BleSpecificEventHandler)callback;
        msg.context = context;
        msg.hook = gattcEventProcessedHook;
        msg.hookContext = this;
        BleObject::getInstance().dispatcher()->enqueue(msg);
    }
    resetDiscoveryState();
    return ret;
}

int BleObject::GattClient::discoverCharacteristics(hal_ble_conn_handle_t connHandle, const hal_ble_svc_t* service, on_ble_disc_char_cb_t callback, void* context) {
    if (!BleObject::getInstance().connMgr()->valid(connHandle)) {
        LOG(ERROR, "Connection invalid.");
        return SYSTEM_ERROR_NOT_FOUND;
    }
    if (isDiscovering_) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    if (os_semaphore_create(&discoverySemaphore_, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }
    SCOPE_GUARD({
        os_semaphore_destroy(discoverySemaphore_);
        discoverySemaphore_ = nullptr;
    });
    ble_gattc_handle_range_t handleRange = {};
    handleRange.start_handle = service->start_handle;
    handleRange.end_handle = service->end_handle;
    currDiscConnHandle_ = connHandle;
    currDiscSvc_ = *service;
    currDiscProcedure_ = DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_CHARACTERISTICS;
    int ret = sd_ble_gattc_characteristics_discover(connHandle, &handleRange);
    if (ret != NRF_SUCCESS) {
        resetDiscoveryState();
        CHECK_NRF_RETURN(ret, sysError(ret));
    }
    isDiscovering_ = true;
    ret = SYSTEM_ERROR_NONE;
    os_semaphore_take(discoverySemaphore_, BLE_DICOVERY_PROCEDURE_TIMEOUT_MS, false);
    // Now discover characteristic descriptors
    if (!BleObject::getInstance().connMgr()->valid(connHandle)) {
        LOG(ERROR, "Connection invalid.");
        resetDiscoveryState();
        return SYSTEM_ERROR_NOT_FOUND;
    }
    currDiscProcedure_ = DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_DESCRIPTORS;
    if (sd_ble_gattc_descriptors_discover(currDiscConnHandle_, &handleRange) != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gattc_descriptors_discover() failed: %u", (unsigned)ret);
    } else {
        ret = SYSTEM_ERROR_NONE;
        if (os_semaphore_take(discoverySemaphore_, BLE_DICOVERY_PROCEDURE_TIMEOUT_MS, false)) {
            ret = SYSTEM_ERROR_TIMEOUT;
        }
    }
    hal_ble_char_t* characteristics = (hal_ble_char_t*)malloc(discoveredCharacteristics_.size() * sizeof(hal_ble_char_t));
    if (characteristics) {
        LOG_DEBUG(TRACE, "Discovered characteristics address: %u, len: %u", (unsigned)characteristics, discoveredCharacteristics_.size() * sizeof(hal_ble_char_t));
        BleObject::BleEventDispatcher::EventMessage msg;
        msg.evt.type = BLE_EVT_CHAR_DISCOVERED;
        msg.evt.version = BLE_API_VERSION;
        msg.evt.size = sizeof(hal_ble_evts_t);
        msg.evt.params.char_disc.conn_handle = currDiscConnHandle_;
        msg.evt.params.char_disc.count = discoveredCharacteristics_.size();
        size_t i = 0;
        for (const auto& characteristic : discoveredCharacteristics_) {
            memcpy(characteristics + i, &characteristic, characteristic.size);
            i++;
        }
        msg.evt.params.char_disc.characteristics = characteristics;
        msg.handler = (BleObject::BleEventDispatcher::BleSpecificEventHandler)callback;
        msg.context = context;
        msg.hook = gattcEventProcessedHook;
        msg.hookContext = this;
        BleObject::getInstance().dispatcher()->enqueue(msg);
    }
    resetDiscoveryState();
    return ret;
}

int BleObject::GattClient::setDesiredAttMtu(size_t attMtu) {
    desiredAttMtu_ = std::min(attMtu, (size_t)BLE_MAX_ATT_MTU_SIZE);
    return SYSTEM_ERROR_NONE;
}

ssize_t BleObject::GattClient::writeAttribute(hal_ble_conn_handle_t connHandle, hal_ble_attr_handle_t attrHandle, const uint8_t* buf, size_t len, bool response) {
    if (buf == nullptr || len == 0) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (!BleObject::getInstance().connMgr()->valid(connHandle)) {
        LOG(ERROR, "Connection invalid.");
        return SYSTEM_ERROR_NOT_FOUND;
    }
    ble_gattc_write_params_t writeParams;
    if (os_semaphore_create(&readWriteSemaphore_, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }
    SCOPE_GUARD({
        os_semaphore_destroy(readWriteSemaphore_);
        readWriteSemaphore_ = nullptr;
    });
    if (response) {
        writeParams.write_op = BLE_GATT_OP_WRITE_REQ;
    } else {
        writeParams.write_op = BLE_GATT_OP_WRITE_CMD;
    }
    len = std::min(len, (size_t)BLE_ATTR_VALUE_PACKET_SIZE(getAttMtu(connHandle)));
    writeParams.flags = BLE_GATT_EXEC_WRITE_FLAG_PREPARED_WRITE;
    writeParams.handle = attrHandle;
    writeParams.offset = 0;
    writeParams.len = len;
    writeParams.p_value = buf;
    int ret = sd_ble_gattc_write(connHandle, &writeParams);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gattc_write() failed: %u", (unsigned)ret);
        return sysError(ret);
    }
    if (os_semaphore_take(readWriteSemaphore_, BLE_READ_WRITE_PROCEDURE_TIMEOUT_MS, false)) {
        return SYSTEM_ERROR_TIMEOUT;
    }
    return len;
}

// FIXME: Multi-link read
ssize_t BleObject::GattClient::readAttribute(hal_ble_conn_handle_t connHandle, hal_ble_attr_handle_t attrHandle, uint8_t* buf, size_t len) {
    if (buf == nullptr || len == 0) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (!BleObject::getInstance().connMgr()->valid(connHandle)) {
        LOG(ERROR, "Connection invalid.");
        return SYSTEM_ERROR_NOT_FOUND;
    }
    if (os_semaphore_create(&readWriteSemaphore_, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }
    SCOPE_GUARD({
        os_semaphore_destroy(readWriteSemaphore_);
        readWriteSemaphore_ = nullptr;
    });
    readAttrHandle_ = attrHandle;
    readBuf_ = buf;
    readLen_ = std::min(len, (size_t)BLE_ATTR_VALUE_PACKET_SIZE(getAttMtu(connHandle)));
    int ret = sd_ble_gattc_read(connHandle, attrHandle, 0);
    if (ret != NRF_SUCCESS) {
        readBuf_ = nullptr;
        readAttrHandle_ = BLE_INVALID_ATTR_HANDLE;
        LOG(ERROR, "sd_ble_gattc_read() failed: %u", (unsigned)ret);
        return sysError(ret);
    }
    if (os_semaphore_take(readWriteSemaphore_, BLE_READ_WRITE_PROCEDURE_TIMEOUT_MS, false)) {
        return SYSTEM_ERROR_TIMEOUT;
    }
    return readLen_;
}

void BleObject::GattClient::resetDiscoveryState() {
    discoverAll_ = false;
    isDiscovering_ = false;
    currDiscConnHandle_ = BLE_INVALID_CONN_HANDLE;
    currDiscProcedure_ = DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_IDLE;
    discoveredServices_.clear();
    discoveredCharacteristics_.clear();
}

bool BleObject::GattClient::readServiceUUID128IfNeeded() const {
    for (const auto& service : discoveredServices_) {
        if (service.uuid.type == BLE_UUID_TYPE_128BIT_SHORTED) {
            return (sd_ble_gattc_read(currDiscConnHandle_, service.start_handle, 0) == NRF_SUCCESS);
        }
    }
    return false;
}

